var eight=["外倾思维型 Te。这种人按固定的规则生活，客观、冷静，善于思考但固执己见。他们通常压抑天性中感性的一面，因而显得缺乏鲜明的个性，甚至冷漠无情。如果压抑过分，则会变得专制、自负、迷信，拒绝接受任何批评。以外向思维作为主要功能的性格是是 ESTJ 和 ENTJ 两种性格，这两种性格都是典型的管理者性格。",
  "内倾思维型 Ti。这种人喜欢离群索居，由于判断力贫乏而不愿社交。他们极端聪明却又不顾实际。发展过度就会变得顽固执拗，刚愎自用，不体谅别人，骄傲自大，拒人于千里之外。",
  "外向情感型 Fe。这种类型的人以女性较多，她们理智屈从于情感，往往表现为反复无常，朝秦暮楚，多愁善感，浮夸卖弄，过分殷勤，强烈地依恋他人但情感并不执著。（那个，女性朋友们别打我，这是荣格的原话。）",
  "内倾情感型 Fi。这种人文静多思，敏感忧郁，沉默寡言，难以捉摸，然而有时又表现得恬淡宁静、怡然自得，给人以莫测高深之感。",
  "外倾感觉型 Se。这种人追求欢乐、善于社交、不断寻求新的刺激，他们头脑清醒但对事物浅尝辄止，他们情感浅薄经常沉溺于各种嗜好，具有恋态行为和强迫行为。",
  "内倾感觉型简称 Si。这种人爱好艺术，沉浸在自我主观感觉中，与自己的内心世界相比，他们觉得外部世界索然乏味。这种类型的大多数人表现得较为沉静、随和，有一定的自制力，但思维和情感大都不够深沉。",
  "外倾直觉型 Ne。这种人异想天开，喜怒无常，见异思迁，好高鹜远，一个问题没解决又忙于解决另一个问题，不能持之以恒，由于情感转移快，难得知己。",
  "内倾直觉型 Ni。这种人往往是能产生一些新奇观念的梦想家，别人看他们不可思议，而他们自己却自视甚高，自以为是不被理解的天才。荣格描述 Ni 是原始意象的内在联系，它使得主体通过直觉获得了事物的本质认识，从而能够还原过去和预测将来的变化。他们可以在封闭的环境中、在仅获得少量情报的情况下顿悟出事物的答案，并且对未来即将发生的变化而感到兴奋。"
]
